// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
  let time = +prompt ('Введіть число від 1 до 59')
  if (time <=15) {console.log('Зараз 1 четверть години')}
  else if (time <=30) {console.log('Зараз 2 четверть години')}
  else if (time <=45) {console.log('Зараз 3 четверть години')}
  else if (time <=59) {console.log('Зараз 4 четверть години')}

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
let day = +prompt ('Введіть день місяця')
if(day <= 15) {console.log('Зараз 1 половина')}
  else if(day <= 31) {console.log('Зараз 2 половина місяця')}
  else if(day > 31) {console.log('Введено число більше ніж днів в місяці')}

// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
let test = 'abc';
if (test === true) { console.log('Вірно')
} else {console.log('Неправильно')}
(test === true) ?console.log('Вірно') : console.log('Неправильно');

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
let number = +prompt('Введіть число 1, 0 , -3');
if (number !== 0){ console.log('ВІРНО')}
else {console.log('НЕВІРНО')}

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
let dayWeeks = +prompt('Введіть день тижня від 1 до 7')
switch (dayWeeks) {
    case 1: console.log('ПОНЕДІЛОК: день бездельник');
        break;
    case 2: console.log('ВІВТОРОК: вихідний після понеділка')
        break;
    case 3: console.log('СЕРЕДА: день Тамада')
        break;
    case 4: console.log('ЧЕТВЕР: всі заботи на потім')
        break;
    case 5: console.log('ПЯТНИЦЯ: Пʼяниця')
        break;
    case 6: console.log('СУБОТА: не работа')
        break;
    case 7: console.log('НЕДІЛЯ: день радості')
        break;
        default: console.log("Щось не то")
}
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
let year = +prompt('Введіть будь який рік');
if(year % 4 === 0){console.log('Цей рік високосний');
}else {console.log('Цей рік не високосний');}

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
let oficialName = prompt('Яка «офіційна» назва JavaScript?');
if(oficialName === 'ECMAScript'){
   alert('Правильно');
} else{
   alert('Неправильно, офіційна назва - ECMAScript!');
}








