// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

let first = +prompt('Введіть перше число');
let second = +prompt('Введіть друге число');
if (first > second){
    console.log(first)
} else if (first === second){
    console.log('Введені числа рівні')
} else {
    console.log(second);
}

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let number = +prompt('Введіть номер квартири');
if (number > 0 && number <= 20) {
    console.log('Вказана квартира знаходиться у 1 підїзді')
} else if (number >= 21 && number <= 48) {
    console.log('Вказана квартира знаходиться у 2 підїзді')
} else if (number >= 49 && number <= 90) {
    console.log('Вказана квартира знаходиться у 3 підїзді')
}
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let numberT = 11;
if(numberT === 10){console.log('ВІРНО')}
else{console.log('НЕ ВІРНО')}

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

let writeT = "[]";
if (typeof writeT === 'number') {
    document.write('це число')
} else if (typeof writeT === "string") {
    document.write('це текст')
} else if (typeof writeT === "object") {
    document.write('це обєкт')
} else if (typeof writeT === "boolean") {
    document.write('це булеве значення')
} else {
    document.write('не зрозуміло що ви ввели')
}
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
let weatherTemp = +prompt('Яка сьогодні температура на вулиці? Введіть число')
if (weatherTemp >= 10 && weatherTemp <= 22) {
    console.log('ми йдемо ВЧИТИСЯ')
    alert('ми йдемо ВЧИТИСЯ')
    document.write('ми йдемо ВЧИТИСЯ')
} else {
    console.log('сидимо вдома і вчимося ОНЛАЙН')
    alert('сидимо вдома і вчимося ОНЛАЙН')
    document.write('сидимо вдома і вчимося ОНЛАЙН')
}

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let poleChudes = +prompt("Введите число от 1 до 5");
switch(poleChudes)
{    case 1:
        alert("Вітаємо! Ви виграли автомобіль!!!");
        break;
    case 2:
        alert("Вітаємо! Ви виграли мотобайк!!!");
        break;
    case 3:
        alert("Вітаємо! Ви виграли велосипед!!!");
        break;
    case 4:
        alert("Вітаємо! Ви виграли самокат!!!");
        break;
    case 5:
        alert("Вітаємо! Ви виграли гіроборд!!!");
        break;
    default:
        alert("Ви ввели не те число.....До побачення. Ви самое слабое звино!!! ПРОЩАЙТЕ!!!");
}



