// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
// Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >=3 )
{console.log('це великий масив, в якому  3 і більше елементи.');
}
else if (friends.length <=3) {console.log ('це маленький масив, в якому менше 3-х елементів')}

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

x=+prompt("Введите число:");
y=+prompt("Введите число:");
z=+prompt("Введите число:");

if (x>y) (y<z)
let w = y;
alert(w);

if (x<y) (x>z)
let w = x;
alert(w);

if (z<x) (z>y)
let w = z;
alert(w);

// - Перепишіть конструкцію if з використанням умовного оператора '?':
let result;
if (a + b < 4) {
    result = 'Мало';
} else {
    result = 'Багато';
}

(result (a + b < 4) ? (result = 'Мало') : (result = 'Багато'))

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let number = +prompt('введіть число')
`$number > 0 ? console.log ('число позитивне' )$number < 0 ? console.log ('число негативне')$number === 0 ? console.log ('число є ноль')`